## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dns_zone.games_ruut will be created
  + resource "azurerm_dns_zone" "games_ruut" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "pelit.ruut.me"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "cs2-servers"
    }

  # azurerm_subnet.cs_subnet will be created
  + resource "azurerm_subnet" "cs_subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "internal"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cs2-servers"
      + virtual_network_name                           = "cs-network"
    }

  # azurerm_virtual_network.cs_network will be created
  + resource "azurerm_virtual_network" "cs_network" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "cs-network"
      + resource_group_name = "cs2-servers"
      + subnet              = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ns             = (known after apply)
```
</details>